
#include <stm32f10x.h>

/****************************************************************************
* 名    称：void fDelayUs(__IO uint32_t nCount)
* 功    能：延时，微秒-毫秒级
* 入口参数：32位无符号整形数值……， nCount * 11*T'clock,72MHz,则 nCount *11 / 72 us
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/ 
void fDelayUs(__IO uint32_t nCount)
{
	for ( ; nCount != 0 ; nCount --);
}

/****************************************************************************
* 名    称：void RCC_Configuration(void)
* 功    能：系统时钟配置为72MHZ
* 入口参数：无
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/ 
void RCC_Configuration(void)
{   
  SystemInit();
}
